RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32E50x_Firmware_Library/GD32E50x_standard_peripheral/Include/gd32e50x_usart.h
/* USARTx_DATA */
#define USART_DATA_DATA               BITS(0,8)    /*!< transmit or read data value */

/* USARTx_BAUD */
#define USART_BAUD_FRADIV             BITS(0,3)    /*!< fraction part of baud-rate divider */
#define USART_BAUD_INTDIV             BITS(4,15)   /*!< integer part of baud-rate divider */

/* USARTx_CTL0 */
#define USART_CTL0_SBKCMD             BIT(0)                         /*!< send break command */
#define USART_CTL0_RWU                BIT(1)                         /*!< receiver wakeup from mute mode */
#define USART_CTL0_REN                BIT(2)                         /*!< enable receiver */
#define USART_CTL0_TEN                BIT(3)                         /*!< enable transmitter */
#define USART_CTL0_IDLEIE             BIT(4)                         /*!< enable idle line detected interrupt */
#define USART_CTL0_RBNEIE             BIT(5)                         /*!< enable read data buffer not empty interrupt and overrun error interrupt */
#define USART_CTL0_TCIE               BIT(6)                         /*!< enable transmission complete interrupt */
#define USART_CTL0_TBEIE              BIT(7)                         /*!< enable transmitter buffer empty interrupt */
#define USART_CTL0_PERRIE             BIT(8)                         /*!< enable parity error interrupt */
#define USART_CTL0_PM                 BIT(9)                         /*!< parity mode */
#define USART_CTL0_PCEN               BIT(10)                        /*!< enable parity check function */
#define USART_CTL0_WM                 BIT(11)                        /*!< wakeup method in mute mode */
#define USART_CTL0_WL                 BIT(12)                        /*!< word length */
#define USART_CTL0_UEN                BIT(13)                        /*!< enable USART */
#define USART_CTL0_OVSMOD             BIT(15)                        /*!< oversample mode */

/* USARTx_CTL1 */
#define USART_CTL1_ADDR               BITS(0,3)                      /*!< address of USART */
#define USART_CTL1_LBLEN              BIT(5)                         /*!< LIN break frame length */
#define USART_CTL1_LBDIE              BIT(6)                         /*!< eanble LIN break detected interrupt */
#define USART_CTL1_CLEN               BIT(8)                         /*!< CK length */
#define USART_CTL1_CPH                BIT(9)                         /*!< CK phase */
#define USART_CTL1_CPL                BIT(10)                        /*!< CK polarity */
#define USART_CTL1_CKEN               BIT(11)                        /*!< enable CK pin */
#define USART_CTL1_STB                BITS(12,13)                    /*!< STOP bits length */
#define USART_CTL1_LMEN               BIT(14)                        /*!< enable LIN mode */

/* USARTx_CTL2 */
#define USART_CTL2_ERRIE              BIT(0)                         /*!< enable error interrupt */
#define USART_CTL2_IREN               BIT(1)                         /*!< enable IrDA mode */
#define USART_CTL2_IRLP               BIT(2)                         /*!< IrDA low-power */
#define USART_CTL2_HDEN               BIT(3)                         /*!< enable half-duplex */
#define USART_CTL2_NKEN               BIT(4)                         /*!< mode NACK enable in smartcard */
#define USART_CTL2_SCEN               BIT(5)                         /*!< senable martcard mode */
#define USART_CTL2_DENR               BIT(6)                         /*!< enable DMA request for reception */
#define USART_CTL2_DENT               BIT(7)                         /*!< enable DMA request for transmission */
#define USART_CTL2_RTSEN              BIT(8)                         /*!< enable RTS */
#define USART_CTL2_CTSEN              BIT(9)                         /*!< enable CTS */
#define USART_CTL2_CTSIE              BIT(10)                        /*!< enable CTS interrupt */
#define USART_CTL2_OSB                BIT(11)                        /*!< one sample bit method */

/* USARTx_GP */
#define USART_GP_PSC                  BITS(0,7)    /*!< prescaler value for dividing the system clock */
#define USART_GP_GUAT                 BITS(8,15)   /*!< guard time value in smartcard mode */

/* USARTx_CTL3 */
#define USART_CTL3_RTEN               BIT(0)       /*!< receiver timeout enable */
#define USART_CTL3_SCRTNUM            BITS(1,3)    /*!< smartcard auto-retry number */
#define USART_CTL3_RTIE               BIT(4)       /*!< interrupt enable bit of receive timeout event */
#define USART_CTL3_EBIE               BIT(5)       /*!< interrupt enable bit of end of block event */
#define USART_CTL3_RINV               BIT(8)       /*!< RX pin level inversion */
#define USART_CTL3_TINV               BIT(9)       /*!< TX pin level inversion */
#define USART_CTL3_DINV               BIT(10)      /*!< data bit level inversion */
#define USART_CTL3_MSBF               BIT(11)      /*!< most significant bit first */

/* USARTx_RT */
#define USART_RT_RT                   BITS(0,23)   /*!< receiver timeout threshold */
#define USART_RT_BL                   BITS(24,31)  /*!< block length */

/* USARTx_STAT1 */
#define USART_STAT1_RTF               BIT(11)      /*!< receiver timeout flag */
#define USART_STAT1_EBF               BIT(12)      /*!< end of block flag */
#define USART_STAT1_BSY               BIT(16)      /*!< busy flag */

/* USARTx_GDCR */
#define USART_GDCTL_CDEN               BIT(1)      /*!< collision detection enable */
#define USART_GDCTL_CD                 BIT(8)      /*!< collision detected status */
#define USART_GDCTL_CDIE               BIT(16)     /*!< collision detected interrupt enable */

/* USART5 bits definitions */
/* USART5_CTL0 */
#define USART5_CTL0_UEN                BIT(0)           /*!< USART5 enable */
#define USART5_CTL0_UESM               BIT(1)           /*!< USART5 enable in Deep-sleep mode */
#define USART5_CTL0_REN                BIT(2)           /*!< receiver enable */
#define USART5_CTL0_TEN                BIT(3)           /*!< transmitter enable */
#define USART5_CTL0_IDLEIE             BIT(4)           /*!< idle line detected interrupt enable */
#define USART5_CTL0_RBNEIE             BIT(5)           /*!< read data buffer not empty interrupt and overrun error interrupt enable */
#define USART5_CTL0_TCIE               BIT(6)           /*!< transmission complete interrupt enable */
#define USART5_CTL0_TBEIE              BIT(7)           /*!< transmitter buffer empty interrupt enable */
#define USART5_CTL0_PERRIE             BIT(8)           /*!< parity error interrupt enable */
#define USART5_CTL0_PM                 BIT(9)           /*!< parity mode */
#define USART5_CTL0_PCEN               BIT(10)          /*!< parity check function enable */
#define USART5_CTL0_WM                 BIT(11)          /*!< wakeup method in mute mode */
#define USART5_CTL0_WL                 BIT(12)          /*!< word length */
#define USART5_CTL0_MEN                BIT(13)          /*!< mute mode enable */
#define USART5_CTL0_AMIE               BIT(14)          /*!< ADDR match interrupt enable */
#define USART5_CTL0_OVSMOD             BIT(15)          /*!< oversample mode */
#define USART5_CTL0_RTIE               BIT(26)          /*!< receiver timeout interrupt enable */
#define USART5_CTL0_EBIE               BIT(27)          /*!< End of Block interrupt enable */

/* USART5_CTL1 */
#define USART5_CTL1_ADDM               BIT(4)           /*!< address detection mode */
#define USART5_CTL1_LBLEN              BIT(5)           /*!< LIN break frame length */
#define USART5_CTL1_LBDIE              BIT(6)           /*!< LIN break detection interrupt enable */
#define USART5_CTL1_CLEN               BIT(8)           /*!< last bit clock pulse */
#define USART5_CTL1_CPH                BIT(9)           /*!< clock phase */
#define USART5_CTL1_CPL                BIT(10)          /*!< clock polarity */
#define USART5_CTL1_CKEN               BIT(11)          /*!< ck pin enable */
#define USART5_CTL1_STB                BITS(12,13)      /*!< stop bits length */
#define USART5_CTL1_LMEN               BIT(14)          /*!< LIN mode enable */
#define USART5_CTL1_STRP               BIT(15)          /*!< swap TX/RX pins */
#define USART5_CTL1_RINV               BIT(16)          /*!< RX pin level inversion */
#define USART5_CTL1_TINV               BIT(17)          /*!< TX pin level inversion */
#define USART5_CTL1_DINV               BIT(18)          /*!< data bit level inversion */
#define USART5_CTL1_MSBF               BIT(19)          /*!< most significant bit first */
#define USART5_CTL1_RTEN               BIT(23)          /*!< receiver timeout enable */
#define USART5_CTL1_ADDR               BITS(24,31)      /*!< address of the USART terminal */

/* USART5_CTL2 */
#define USART5_CTL2_ERRIE              BIT(0)           /*!< error interrupt enable in multibuffer communication */
#define USART5_CTL2_IREN               BIT(1)           /*!< IrDA mode enable */
#define USART5_CTL2_IRLP               BIT(2)           /*!< IrDA low-power */
#define USART5_CTL2_HDEN               BIT(3)           /*!< half-duplex enable */
#define USART5_CTL2_NKEN               BIT(4)           /*!< NACK enable in smartcard mode */
#define USART5_CTL2_SCEN               BIT(5)           /*!< smartcard mode enable */
#define USART5_CTL2_DENR               BIT(6)           /*!< DMA enable for reception */
#define USART5_CTL2_DENT               BIT(7)           /*!< DMA enable for transmission */
#define USART5_CTL2_OSB                BIT(11)          /*!< one sample bit mode */
#define USART5_CTL2_OVRD               BIT(12)          /*!< overrun disable */
#define USART5_CTL2_DDRE               BIT(13)          /*!< disable DMA on reception error */
#define USART5_CTL2_SCRTNUM            BITS(17,19)      /*!< smartcard auto-retry number */
#define USART5_CTL2_WUM                BITS(20,21)      /*!< wakeup mode from deep-sleep mode */
#define USART5_CTL2_WUIE               BIT(22)          /*!< wakeup from deep-sleep mode interrupt enable */

